tap "homebrew-zathura/zathura"
tap "mongodb/brew"
tap "nikitabobko/tap"
# Backend processor for BibLaTeX
brew "biber"
# Version manager for neovim
brew "bob"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Language for application scale JavaScript development
brew "typescript"
# Markup-based typesetting system
brew "typst"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# PDF viewer
brew "homebrew-zathura/zathura/zathura"
# Poppler backend plugin for zathura
brew "homebrew-zathura/zathura/zathura-pdf-poppler"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
cask "font-go-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Password manager application and digital vault
cask "keeper-password-manager"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Data science software focusing on R and Python
cask "rstudio"
# PDF reader and note-taking application
cask "skim"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "mvllow.rose-pine"
vscode "vscodevim.vim"
go "github.com/bootdotdev/bootdev"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
