{
  "dressing.nvim": { "branch": "master" },
  "harpoon": { "branch": "harpoon2" },
  "lazy.nvim": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "rose-pine": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "typst-preview.nvim": { "branch": "master" },
  "vim-tmux-navigator": { "branch": "master" },
  "vimtex": { "branch": "master" }
}
